import pandas as pd

df = pd.read_csv('data/data1.csv')


# print(df['Period']) # витягуємо колонку 'Period' це і є Series

# Series - це одновимірний масив даних, одна колонка в DataFrame

# print(df['Period'].value_counts()) # отримуємо інформацію про к-сть обєктів в колонці період тобто таке собі групування і виведення к-сті елементів

# print (df['Period'].sort_values(ascending=False)) # сортування в порядку зростання + можна вибрати параметр для того щоб взяти в порядку спадання

# print(df[['Period','STATUS']]) #отримання 2 стовпців або вибраної к-сті стовпців

# print(df.loc[2]) #виводимо інформацію про елемент з індексом 2

# print(df.loc[2:3,['Period','STATUS']]) #виводимо 2 елементи від індекса до індекса + беремо колонки які нам потрібні для DF

# print(df.iloc[2:3,1:3])