import pandas as pd

df = pd.read_csv('data/data1.csv')


# print(df[df['Period'] == 2025.03][['Period','Data_value']]) # виведення інформації де період дорівнює 2025.03, виводимо 2 колонки

# print(df[(df['Period'] == 2025.03) & (df['Data_value']>=300000) ][['Period']].value_counts() ) # отримуємо інформацію по конкретному місяцю і значення більше 300000 а також беремо к-сть таких елементів

# print(df[(df['Period'] == 2025.03) | (df['Period']==2024.12) ][['Period']].value_counts() ) # отримуємо к-сть по місяцево за 2 місяці за допомгою оператора АБО


# print(df[df['Period'].isin([2025.03,2024.12])]) # функція isin отримує інфу по масиву який переданий як параметр

#створення масиву range з дат від 2025-03 до 2025-06

value_range = pd.date_range('2025-03','2025-06')


# print(df.sort_values('Period',ascending=False).head()) # отримуємо перші 5 значень відсортованих за спаданням

# print(df[['Period','Data_value']].sort_values(by=19000,axis=1)) # отримуємо інформацію в рядку з індексом 19000 беремо значення по горизонталі тобто в рядку і сортуємо


# print(df[df.index==19000]) # перевіряємо чи дійсно так через фільтрування